In [19]:
import pandas as pd
import numpy as np

In [49]:
df = pd.read_excel('./suzanturmaua/dados_linhas.xlsx')
df.head()

                        Texto
0      Clique para Selecionar
1  Linha 20 – Sertão Expresso
2     Linha 22 – Vila Carlina
3           Linha 23 – Acibam
4       Linha 25 – Guaraciaba

In [34]:
df= df.drop(0)
df.head()

                        Texto
1  Linha 20 – Sertão Expresso
2     Linha 22 – Vila Carlina
3           Linha 23 – Acibam
4       Linha 25 – Guaraciaba
5  Linha 31 – PQ. São Vicente

In [38]:
df.dtypes

Texto    object
dtype: object

In [43]:
df_split = df['Texto'].str.split(' ', n=3, expand=True)

In [45]:
df_split.head()

       0   1  2                3
1  Linha  20  –  Sertão Expresso
2  Linha  22  –     Vila Carlina
3  Linha  23  –           Acibam
4  Linha  25  –       Guaraciaba
5  Linha  31  –  PQ. São Vicente

In [46]:
df_split.columns = ['0','linha','1','nome da linha']

In [47]:
df_split.head()

       0 linha  1    nome da linha
1  Linha    20  –  Sertão Expresso
2  Linha    22  –     Vila Carlina
3  Linha    23  –           Acibam
4  Linha    25  –       Guaraciaba
5  Linha    31  –  PQ. São Vicente

In [52]:
df = df_split.drop(columns=['0','1'])
df.head()

  linha    nome da linha
1    20  Sertão Expresso
2    22     Vila Carlina
3    23           Acibam
4    25       Guaraciaba
5    31  PQ. São Vicente

In [54]:
df.to_csv('linhas_onibus_maua.csv', index=False)